openfoam/sim1/system/meshDict

// some useful commands:
// cartesianMesh -> creates mesh using hex things
// checkMesh    -> does a check??
// checkSurfaceMesh -> performs basic topology and geometric checks on input surface mesh
// improveMeshQuality   -> applies a smoother to the mesh in order to improve overall quality, number of parameters is controllable via optional parameters
// surfaceToFMS -> converts a common surface triangulation (stl) into fms format
// surfaceFeatureEdges <input> <output> -angle <sFE_angle>  -> used for extracting feature edges (sharp angles). if output is a fms file, the extracted edges are stored as feature edges. otherwise generates patches bounded by the selected feature edges
// surfaceGenerateBoundingBox <input stl file> <output stl file> xNeg xPos yNeg yPos zNeg zPos -> does the bounding box for boundary surfaces


FoamFile
{
    version 2.0;
    format  ascii;
    class   dictionary;
    location    "system";
    object  meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *

surfaceFile "constant/triSurface/sott1.stl";

minCellSize 0.004;

maxCellSize 0.800;

boundaryCellSize 0.110;

localRefinement
{
    "plane"
    {
        cellSize 0.020;
        //additionalRefinementLevels 6;
        //refinementThickness 0.020;
    }
}

boundaryLayers
{
    patchBoundaryLayers
    {
        "plane"
        {
            nLayers 5;
            thicknessRatio 1.1;
            maxFirstLayerThickness 0.010;
            allowDiscontinuity 1;
        }
    }
}

renameBoundary
{
    defaultName default_boundary;
    defaultType wall;

    newPatchNames
    {
    	"plane.*"
        {
            type    wall;
            newName plane;
        }
        
        "xMax"
        {
            type    patch;
            newName inlet;
        }

        "xMin"
        {
            type    patch;
            newName outlet;
        }

        "yMin"
        {
            type    patch;
            newName sideYmin;
        }

        "yMax"
        {
            type    patch;
            newName sideYmax;
        }

        "zMin"
        {
            type    wall;
            newName floor;
        }

        "zMax"
        {
            type    patch;
            newName ceiling;
        }
    }
}
